app/controllers/concerns/authenticatable.rb

  def authenticate_request!
    token = extract_bearer_token
    return render_unauthorized unless token

    payload = decode_token(token)
    return render_unauthorized unless payload

    @current_user = User.find_by(id: payload["user_id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]